# Homebrew Bundle - Development Environment Dependencies
# Install with: brew bundle install
# Check status: brew bundle check

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Shell and terminal
brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "tmux"

# Version control
brew "git"
brew "git-delta"        # Alternative to diff-so-fancy
brew "diff-so-fancy"

# Editor
brew "neovim"
brew "vim"

# Search and file tools
brew "ripgrep"
brew "fzf"
brew "bat"              # Cat with syntax highlighting
brew "eza"              # Modern ls replacement
brew "fd"               # Fast find replacement
brew "zoxide"           # Smart cd with frecency

# Data processing
brew "jq"               # JSON processor
brew "yq"               # YAML processor

# System utilities
brew "btop"             # Beautiful process viewer
brew "tldr"             # Simplified man pages

# Development tools
brew "asdf"             # Version manager for languages

# Security
brew "gnupg"
brew "pinentry-mac"

# Container tools (optional)
# brew "docker"
# brew "docker-compose"

# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"
